Revit 2027 API
CylindricalHelix.Pitch Property
The pitch of the cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Pitch { get; }
Public ReadOnly Property Pitch As Double
	Get
public:
property double Pitch {
	double get ();
}
member Pitch : float with get
Property Value
Double
Remarks
 It is the distance moved along the axis direction when a point makes one rotation about the axis. Pitch can be positive or negative.
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace